Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F28C.tmx
Source language: en_us
Languages: zh_cn

source: The Lifestyle That Is Best For The Aging Brain
zh_cn: 对衰老的大脑最好的生活方式

source: Older adults who have a busy lifestyle also have better cognitive function, new research reports.
zh_cn: 新的调研显示生活忙碌的老人认知能力更好。

source: The results come from one of the most comprehensive studies of how the brain changes with age: The Dallas Lifespan Brain Study.
zh_cn: 这一结果来自达拉斯寿命与大脑研究（The Dallas Lifespan Brain Study），它是探究大脑如何随年龄增长而变化的项目中最为全面、细致的研究之一。

source: Dr Sara Festini, the study's first author, said: "
zh_cn: 研究的第一作者Sara Festini博士说：

source: We show that people who report greater levels of daily busyness tend to have better cognition, especially with regard to memory for recently learned information.
zh_cn: 我们展示了这一点：日常生活更为忙碌的人往往有更好的认知能力，这一点在近期记忆上表现尤甚。

source: Living a busy lifestyle appears beneficial for mental function, although additional experimental work is needed to determine if manipulations of busyness have the same effect."
zh_cn: “虽然需要其他实验才能确定有意造成的忙碌是否同样有效，但忙碌的生活方式似乎对智力机能有好处。”

source: The Dallas Lifespan Brain Study included 330 people aged between 50 and 89.
zh_cn: 达拉斯寿命与大脑研究包含了330位被试，他们的年龄横跨50到89岁。

source: Their daily routines were recorded along with their cognitive performance.
zh_cn: 这些被试每天的常规活动与他们的认知表现一起被记录了下来。

source: The results showed that whatever age they were, the brains of people who were busier worked better.
zh_cn: 结果显示，无论年岁几何，越是忙碌的人，其大脑运作得越好。
